## Δυνατότητα #1 Auto login & Auto start in Raspberry Pi
## Περιγραφή
Για να το πραγματοποιήσουμε αυτό θα πρέπει να κάνουμε τα εξής:

Αρχικά ρυθμίζουμε το rasperry Pi να κάνει AUTO LOGIN σε text console ως pi user,
αυτό γίνεται με τα εξής βήματα:
Βήμα 1ο: Ανοίγουμε το LXTerminal και κάνουμε διόρθωση(edit) στο αρχείο inittab

sudo nano /etc/inittab

Βήμα 2ο: Απενεργοποιούμε το getty program
πλοηγούμαστε στην ακόλουθη γραμμή του inittab

1:2345:respawn:/sbin/getty 38400 tty1

το νούμερο 38400 μπορείνα είναι 115200 or 57600 or 9600 κτλ.
και πρόσθεστε το # στην αρχή της γραμμής ώστε να γίνει σχόλιο(comment)

#1:2345:respawn:/sbin/getty 38400 tty1

Βήμα 3ο: Προσθέστε login δυνατότητα στο inittab

Αυτό γίνεται αν προσθέσουμε ακριβώς από κάτω από τη γραμμή που κάναμε σχόλιο την ακόλουθη γραμμή:

1:2345:respawn:/bin/login -f pi tty1 </dev/tty1 >/dev/tty1 2>&1

Αυτό θα τρέχει login προγραμμά ως χρήστης pi και χωρίς αυθεντικοποίηση

Βήμα 4ο: Σώστε και εξέρθετε από το terminal

Πατήστε Ctrl+X για να εξέρθετε από τον κειμενογράφο και ακολούθως πατήστε Y για σωθεί το αρχείο και Enter να επιβεβαιωθεί το filename

Επανεκκινήστε το Raspberry Pi και θα δείτε να εκκινεί απευθείας σε shell prompt pi@raspberrypi χωρίς να χρειάζεται να εισάγετε όνομα χρήστη (username) και κωδικό επαλήθευσης 
(password). 
Αυτό όμως δεν αρκεί, χρειάζεται το Pi να τρέχει αυτόματα κάποιες εντολές ή γραμμές που θέλουμε και αυτό μπορεί να πραγματοποιηθεί με το επόμενο βήμα.

1ος τρόπος 

Ανοίγουμε το terminal και διορθώνουμε το αρχείο /etc/profile

sudo nano /etc/profile

Και προσθέτουμε στο τέλος του αρχείου την ακόλουθη γραμμή

. /home/pi/your_script_name.sh

όπου your_script_name το όνομα του script που θέλουμε να τρέξει με το αντίστοιχο μονοπάτι του

Σώσιμο και έξοδος

Πατήστε Ctrl+X και Y για να σωθεί το αρχείο

2ος τρόπος 

Απλώς στο terminal  ανοίγουμε το bash_login

nano .bash_login

και προσθέτουμε τη γραμμή

sudo ./folder/file

όπου file το αρχείο που θέλουμε να τρέχει και folder ο φακελός που το περιέχει

Ctrl+X και Y να το σώσουμε.

Παρατήρηση:

Για να σταματήσει το πρόγραμμα να τρέχει απλώς πατάμε Ctrl+C.
